# Copyright (c) 2022, NVIDIA CORPORATION. All rights reserved.
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
name: "simple"
platform: "tensorrt"
max_batch_size: 16
input {
  name: "INPUT_1"
  data_type: TYPE_FP32
  dims: -1
}
input {
  name: "INPUT_2"
  data_type: TYPE_STRING
  dims: -1
}
output {
  name: "OUTPUT_1"
  data_type: TYPE_INT32
  dims: 1000
}
instance_group {
  count: 1
  kind: KIND_CPU
}
instance_group {
  count: 2
  kind: KIND_GPU
}
dynamic_batching {
  preferred_batch_size: 16
  preferred_batch_size: 32
  max_queue_delay_microseconds: 100
  preserve_ordering: true
  priority_levels: 3
  default_priority_level: 1
  default_queue_policy {
    timeout_action: DELAY
    default_timeout_microseconds: 100
    allow_timeout_override: true
    max_queue_size: 2
  }
  priority_queue_policy {
    key: 2
    value {
      timeout_action: DELAY
      default_timeout_microseconds: 100
      allow_timeout_override: true
      max_queue_size: 3
    }
  }
}
parameters {
  key: "parameter1"
  value {
    string_value: "value1"
  }
}
parameters {
  key: "parameter2"
  value {
    string_value: "value2"
  }
}
response_cache {
    enable: true
}
